# GetTexBitRepHoriz

## Description
Function GetTexBitRepHoriz returns whether the referenced texture bitmap is set to repeat horizontally.

```pascal
FUNCTION GetTexBitRepHoriz(textureBitmap : HANDLE): BOOLEAN;
```

```python
def vs.GetTexBitRepHoriz(textureBitmap):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|textureBitmap|HANDLE|Handle to texture bitmap.|

## Remarks
Returns TRUE if this texture bitmap repeats horizontally.

## Version
Availability: from VectorWorks8.0

## Category
* Textures